{
  "Home": {
    "title": "Développeur React et Next.js",
    "text": "Développeur web frontend, j'utilise <span>React</span>, <span> Next.js</span> et<span> TypeScript</span> pour concevoir des interfaces modernes et responsives. <br></br>J’ai également des notions en développement back-end avec<span> PostgreSQL</span>,<span> Node.js</span>, et<span> Prisma</span>, me permettant d'appréhender l'ensemble du développement web.",
    "mySkills": "Skills",
    "mainSkills": "Core skills",
    "secondarySkills": "Additional skills",
    "myProjects": "Projets",
    "contact": "Que ce soit pour un projet, une collaboration ou simplement échanger, n’hésitez pas à me contacter !",
    "about": "À propos",
    "aboutContent": [
      {
        "title": "Parcours et Reconversion",
        "content": "Après 10 ans dans le secteur automobile, évoluant de technicien à chef d'équipe, j'ai développé de solides compétences en gestion d'équipe et résolution de problèmes. Passionné par le développement web, j'ai entrepris en 2023 une reconversion via OpenClassrooms, me formant aux technologies frontend comme React, Next.js et TypeScript, alliant ainsi ma rigueur technique à ma nouvelle passion."
      },
      {
        "title": "Formation Continue / Veille Technologique",
        "content": "Ma veille technologique s'effectue principalement via LinkedIn et X (Twitter), complétée par le suivi de conférences tech. Je maintiens mes compétences en relevant régulièrement des challenges d'intégration sur Frontend Mentor et en pratiquant des katas hebdomadaires sur Exercism et CodeWars pour améliorer ma logique de programmation."
      },
      {
        "title": "Disponibilité et Recherches",
        "content": "En recherche active, je suis disponible pour des opportunités en CDI, CDD ou missions freelance. Flexible sur les modalités de travail (remote, sur site ou hybride), je suis ouvert à tous types de projets permettant de mettre en pratique mes compétences en développement frontend."
      },
      {
        "title": "Localisation",
        "content": "Basé en Haute-Savoie près de la frontière suisse, je cherche activement des opportunités sur Lausanne et ses environs avec pour objectif de m'y installer. Je reste néanmoins ouvert aux propositions dans toute la région lémanique."
      }
    ]
  },
  "MetaData": {
    "home": {
      "title": "Jérémie Lavergnat - Développeur Front End React et Next.js",
      "description": "Développeur front-end JeremDevX : découvrez mes compétences, mes projets et mon profil."
    }
  },
  "Projects": {
    "gus": {
      "title": "GitHub User Search",
      "description": "Application web moderne de recherche d'utilisateurs GitHub développée avec Next.js. Cette application s'intègre avec l'API REST de GitHub pour fournir une expérience utilisateur fluide et performante.<br></br>Points clés :<br></br>• Interface responsive avec une intégration pixel-perfect suivant les maquettes Figma de Frontend Mentor<br></br>• Implémentation d'un système de thème dynamique (clair/sombre) avec détection automatique des préférences système<br></br>"
    },
    "blog": {
      "title": "Blog and Devtools",
      "description": "Plateforme fullstack combinant un blog technique et une suite d'outils de développement.<br></br>Architecture :<br></br>• Backend headless avec Sanity.io pour la gestion de contenu<br></br>• Frontend Next.js avec génération ISR pour les nouveaux articles<br></br>• Moteur de recherche utilisant des requêtes GROQ pour le blog et API standard pour les outils<br></br>"
    },
    "finance": {
      "title": "Personnal Finance App",
      "description": "Application de gestion financière en cours de développement.<br></br>Points clés :<br></br>• Dashboard interactif avec visualisation des différentes données<br></br>• Système de catégorisation des transactions / économies / factures<br></br>• Système de connexion via NextAuth (à venir)<br></br>• Gestion des données via une BDD PostgreSQL (à venir)<br></br> • Interface responsive selon les maquettes Figma de Frontend Mentor<br></br>"
    }
  }
}
