{
  "Home": {
    "title": "Développeur React et Next.js",
    "text": "Développeur web frontend, j'utilise <span>React</span>, <span> Next.js</span> et<span> TypeScript</span> pour concevoir des interfaces modernes et responsives. <br></br>J’ai également des notions en développement back-end avec<span> PostgreSQL</span>,<span> Node.js</span>, et<span> Prisma</span>, me permettant d'appréhender l'ensemble du développement web.",
    "mySkills": "Skills",
    "mainSkills": "Core skills",
    "secondarySkills": "Additional skills",
    "myProjects": "Projets"
  },
  "projects": {
    "title": "Liste de mes projets"
  },
  "Project": {
    "github": "GitHub du projet"
  },
  "Profile": {
    "title": "Mon profil",
    "infos": "Infos :",
    "personalInfos": " <li> <strong>Nom :</strong> Jérémie L. </li> <li> <strong>Âge :</strong> <ageYear></ageYear> <ageMonth></ageMonth> <ageDay></ageDay> </li> <li> <strong>Nationalité :</strong> Française </li> <li> <strong>Localisation :</strong> France / Suisse </li> <li> <strong>Mail : </strong> jeremdev.contactpro@gmail.com </li> <li> <strong>Langues :</strong> <ul> <li>Français - (Langue natale)</li> <li>Anglais - (Compétence professionnelle)</li> <li>Allemand - (En cours d'apprentissage)</li> </ul> </li>",
    "socialsAndStats": "Réseaux sociaux et stats",
    "years": "ans",
    "month": "mois",
    "months": "mois",
    "day": "jour",
    "and": "et"
  },
  "Navbar": {
    "home": { "label": "Accueil", "href": "/" },
    "projects": { "label": "Réalisations", "href": "/projects" },
    "profile": { "label": "Profil", "href": "/profile" }
  },
  "CarouselHome": {
    "simonGame": "Création d'un jeu de Simon en utilisant React. Projet pour comprendre le state mangement, les cylces de vie des composants et les hooks.",
    "argentBank": "Intégration d'une application bancaire, avec un système d'authentification via une API et un store global via Redux.",
    "ninaCarducci": "Optimisation d'un site web d'une photographe sur le réferecement naturel, la performance et l'accessibilité.",
    "kasa": "Intégration d'un site de location immobilière. Projet pour gérer les routes, les paramètres d'URL et mettre en ouevre des animations CSS via Sass.",
    "qcm": "Création d'une application de QCM. Projet pour gérer une base de données avec un ORM, créer un système d'authetification avec un token JWT et sécuriser les routes."
  },
  "MetaData": {
    "home": {
      "title": "JeremDevX - Développeur Front End React et Next.js",
      "description": "Développeur front-end JeremDevX : découvrez mes compétences, mes projets et mon profil."
    },
    "projects": {
      "title": "JeremDevX - Réalisations",
      "description": "Réalisations de JeremDevX : retrouvez la liste de mes projets avec les technologies utilisées, et les liens vers les dépôts GitHub."
    },
    "profile": {
      "title": "JeremDevX - Profil",
      "description": "Profil JeremDevX : retrouvez la liste de mes réseaux sociaux, mon CV, mes coordonnées et autres."
    }
  },
  "Projects": {
    "gus": {
      "title": "GitHub User Search",
      "description": "Application de recherche d'utilisateurs GitHub. Projet issu du site Frontend Mentor.<br></br>Intégration pixel-perfect d'une maquette en responsive design, avec un système de recherche d'utilisateur via l'API GitHub pour trouver et afficher les informations de son compte.<br></br>L'application possède également un système de thème clair et sombre défini par défaut selon la préférence utilisateur."
    },
    "blog": {
      "title": "Blog and Devtools",
      "description": "Projet personnel de blog et d'outils de développement. <br></br>Le contenu de la partie blog est réalisée à l'aide du headless CMS Sanity.io, la partie outils de développement est réalisée en React.<br></br> Le site possède une barre de recherche codée from scratch pour trouver des articles ou des outils. La recherche d'article se fait via des requêtes GROQ et l'APIO de Sanity.io, la recherche d'outils se fait via une liste JSON."
    },
    "finance": {
      "title": "Personnal Finance App",
      "description": "Work in Progress <br></br>Application de suivi de finance personnelle. Projet issu du site Frontend Mentor. <br></br> Projet en cours de développement, l'application permettra de suivre ses dépenses et ses revenus, de les catégoriser et de les visualiser sous forme de graphiques. Les données sont actuellement stockées sur un fichier JSON, mais seront prochainement stockées sur une base de données ou un headless CMS."
    }
  }
}
