{
  "Home": {
    "title": "Frontend Developer React and Next.js",
    "text": "Frontend web developer, I use <span>React</span>, <span>Next.js</span>, and <span>TypeScript</span> to design modern and responsive interfaces. <br></br>I also have knowledge in back-end development with <span>PostgreSQL</span>, <span>Node.js</span>, and <span>Prisma</span>, allowing me to understand the entire web development process.",
    "mySkills": "Skills",
    "mainSkills": "Core skills",
    "secondarySkills": "Additional skills",
    "myProjects": "Projects",
    "contact": "Whether it’s for a project, a collaboration, or just to connect, feel free to reach out!",
    "about": "About",
    "aboutContent": [
      {
        "title": "Background and Career Change",
        "content": "After 10 years in the automotive industry, evolving from technician to team leader, I developed strong team management and problem-solving skills. Passionate about web development, I undertook a career change in 2023 through OpenClassrooms, training in frontend technologies like React, Next.js and TypeScript, combining my technical rigor with my new passion."
      },
      {
        "title": "Continuous Learning / Technology Watch",
        "content": "My technology watch is mainly done through LinkedIn and X (Twitter), complemented by following tech conferences. I maintain my skills by regularly taking on integration challenges on Frontend Mentor and practicing weekly katas on Exercism and CodeWars to improve my programming logic."
      },
      {
        "title": "Availability and Job Search",
        "content": "Actively looking, I am available for permanent positions, fixed-term contracts or freelance assignments. Flexible on working arrangements (remote, on-site or hybrid), I am open to all types of projects to put my frontend development skills into practice."
      },
      {
        "title": "Location",
        "content": "Based in Haute-Savoie near the Swiss border, I am actively seeking opportunities in Lausanne and its surroundings with the goal of settling there. I remain open to opportunities throughout the Lake Geneva region."
      }
    ]
  },
  "MetaData": {
    "home": {
      "title": "Jérémie Lavergnat - Front End Developer React and Next.js",
      "description": "JeremDevX front-end developer: find out more about my skills, my projects, and my profile."
    }
  },
  "Projects": {
    "gus": {
      "title": "GitHub User Search",
      "description": "GitHub user search application. Project from the Frontend Mentor site.<br></br> Pixel-perfect integration of a mockup in responsive design, with a user search system via the GitHub API to find and display user account information.<br></br> The application also has a light and dark theme system set by default according to user preference."
    },
    "blog": {
      "title": "Blog and Devtools",
      "description": "Personal blog and development tools project.<br></br> The content of the blog section is created using the headless CMS Sanity.io, the development tools section is created in React.<br></br> The site has a search bar coded from scratch to find articles or tools. The article search is done via GROQ queries and the Sanity.io API, the tool search is done via a JSON list."
    },
    "finance": {
      "title": "Personnal Finance App",
      "description": "Work in Progress <br></br>Personal finance tracking application. Project from the Frontend Mentor site. <br></br> Project under development, the application will allow you to track your expenses and income, categorize them, and visualize them in the form of graphs. The data is currently stored in a JSON file, but will soon be stored in a database or a headless CMS."
    }
  },
  "NotFound": {
    "title": "Page non trouvée",
    "description": "La page que vous cherchez n'existe pas. Retournez à l'accueil pour continuer votre navigation.",
    "backToHome": "Retour à l'accueil"
  }
}
