{
  "Home": {
    "title": "Frontend Developer React and Next.js",
    "text": "Frontend web developer, I use <span>React</span>, <span>Next.js</span>, and <span>TypeScript</span> to design modern and responsive interfaces. <br></br>I also have knowledge in back-end development with <span>PostgreSQL</span>, <span>Node.js</span>, and <span>Prisma</span>, allowing me to understand the entire web development process.",
    "mySkills": "Skills",
    "mainSkills": "Core skills",
    "secondarySkills": "Additional skills",
    "myProjects": "Projects",
    "contact": "Whether it’s for a project, a collaboration, or just to connect, feel free to reach out!",
    "about": "About",
    "aboutContent": [
      {
        "title": "Background and Career Change",
        "content": "After 10 years in the automotive industry, evolving from technician to team leader, I developed strong team management and problem-solving skills. Passionate about web development, I undertook a career change in 2023 through OpenClassrooms, training in frontend technologies like React, Next.js and TypeScript, combining my technical rigor with my new passion."
      },
      {
        "title": "Continuous Learning / Technology Watch",
        "content": "My technology watch is mainly done through LinkedIn and X (Twitter), complemented by following tech conferences. I maintain my skills by regularly taking on integration challenges on Frontend Mentor and practicing weekly katas on Exercism and CodeWars to improve my programming logic."
      },
      {
        "title": "Availability and Job Search",
        "content": "Actively looking, I am available for permanent positions, fixed-term contracts or freelance assignments. Flexible on working arrangements (remote, on-site or hybrid), I am open to all types of projects to put my frontend development skills into practice."
      },
      {
        "title": "Location",
        "content": "Based in Haute-Savoie near the Swiss border, I am actively seeking opportunities in Geneva and its surroundings."
      }
    ]
  },
  "MetaData": {
    "home": {
      "title": "Jérémie Lavergnat - Front End Developer React and Next.js",
      "description": "Jérémie Lavergnat - Frontend developer specializing in React and Next.js, I design high-performance and optimized interfaces. Passionate about fullstack development, I am constantly seeking new challenges."
    }
  },
  "Projects": {
    "gus": {
      "title": "GitHub User Search",
      "description": "Modern web application for GitHub users search built with Next.js. This application integrates with GitHub's REST API to provide a smooth and efficient user experience.<br></br>Key features:<br></br>• Responsive interface with pixel-perfect integration following Frontend Mentor's Figma designs<br></br>• Implementation of a dynamic theme system (light/dark) with automatic system preferences detection<br></br>"
    },
    "blog": {
      "title": "Blog and Devtools",
      "description": "Fullstack platform combining a technical blog and a suite of development tools.<br></br>Architecture:<br></br>• Headless backend with Sanity.io for content management<br></br>• Next.js frontend with ISR generation for new articles<br></br>• Search engine using GROQ queries for the blog and standard API for tools<br></br>"
    },
    "finance": {
      "title": "Personal Finance App",
      "description": "Financial management application under development.<br></br>Key features:<br></br>• Interactive dashboard with various data visualization<br></br>• Categorization system for transactions / savings / bills<br></br>• Authentication system via NextAuth (upcoming)<br></br>• Data management through PostgreSQL database (upcoming)<br></br>• Responsive interface following Frontend Mentor's Figma designs<br></br>"
    }
  }
}
