{
  "Home": {
    "title": "Frontend Developer React and Next.js",
    "text": "Frontend web developer, I use <span>React</span>, <span>Next.js</span>, and <span>TypeScript</span> to design modern and responsive interfaces. <br></br>I also have knowledge in back-end development with <span>PostgreSQL</span>, <span>Node.js</span>, and <span>Prisma</span>, allowing me to understand the entire web development process.",
    "mySkills": "Skills",
    "mainSkills": "Core skills",
    "secondarySkills": "Additional skills",
    "myProjects": "Projects"
  },
  "projects": {
    "title": "List of my projects"
  },
  "Project": {
    "github": "Project's GitHub"
  },
  "Profile": {
    "title": "My profile",
    "infos": "Infos:",
    "personalInfos": "<li> <strong>Name :</strong> Jérémie L. </li> <li> <strong>Age :</strong> <ageYear></ageYear> <ageMonth></ageMonth> <ageDay></ageDay></li> <li> <strong>Nationality :</strong> French </li> <li> <strong>Location :</strong> France / Switzerland </li> <li> <strong>Mail : </strong> jeremdev.contactpro@gmail.com </li> <li> <strong>Languages :</strong> <ul> <li>French - (Native language)</li> <li>English - (Professional competence)</li> <li>German - (Currently learning)</li> </ul> </li>",
    "socialsAndStats": "Social networks and stats",
    "years": "years",
    "month": "month",
    "months": "months",
    "day": "day",
    "and": "and"
  },
  "Navbar": {
    "home": { "label": "Home", "href": "/" },
    "projects": { "label": "Projects", "href": "/projects" },
    "profile": { "label": "Profile", "href": "/profile" }
  },
  "CarouselHome": {
    "simonGame": "Creation of a Simon game using React. Project to understand state management, component life cycles, and hooks.",
    "argentBank": "Integration of a banking application, with authentication system via an API and a global store via Redux.",
    "ninaCarducci": "Optimization of a photographer's website on natural referencing, performance, and accessibility.",
    "kasa": "Integration of a real estate rental site. Project to manage routes, URL parameters, and implement CSS animations via Sass.",
    "qcm": "Creation of a quiz application. Project to manage a database with an ORM, create an authentication system with a JWT token, and secure routes."
  },
  "MetaData": {
    "home": {
      "title": "JeremDevX - Front End Developer React and Next.js",
      "description": "JeremDevX front-end developer: find out more about my skills, my projects, and my profile."
    },
    "projects": {
      "title": "JeremDevX - Projects",
      "description": "JeremDevX projects: find the list of my projects with the technologies used, and the links to the GitHub repositories."
    },
    "profile": {
      "title": "JeremDevX - Profile",
      "description": "JeremDevX profile: find the list of my social netprojects, my CV, my contact details, and more."
    }
  },
  "Projects": {
    "gus": {
      "title": "GitHub User Search",
      "description": "GitHub user search application. Project from the Frontend Mentor site.<br></br> Pixel-perfect integration of a mockup in responsive design, with a user search system via the GitHub API to find and display user account information.<br></br> The application also has a light and dark theme system set by default according to user preference."
    },
    "blog": {
      "title": "Blog and Devtools",
      "description": "Personal blog and development tools project.<br></br> The content of the blog section is created using the headless CMS Sanity.io, the development tools section is created in React.<br></br> The site has a search bar coded from scratch to find articles or tools. The article search is done via GROQ queries and the Sanity.io API, the tool search is done via a JSON list."
    },
    "finance": {
      "title": "Personnal Finance App",
      "description": "Work in Progress <br></br>Personal finance tracking application. Project from the Frontend Mentor site. <br></br> Project under development, the application will allow you to track your expenses and income, categorize them, and visualize them in the form of graphs. The data is currently stored in a JSON file, but will soon be stored in a database or a headless CMS."
    }
  }
}
